In [69]:
import pandas as pd
import datetime

In [70]:
# Create DataFrames based on existing csv files
raw_shifts = pd.read_csv('C:\\Users\\Igor\\Desktop\\Mima\\Codetiq\\git\\git_project\\hello-world\\data\\shifts.csv')
display(raw_shifts)
raw_shifts.dtypes

,shift_id,shift_date,shift_start,shift_finish
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00

shift_id        object
shift_date      object
shift_start     object
shift_finish    object
dtype: object

In [71]:
raw_breaks = pd.read_csv('C:\\Users\\Igor\\Desktop\\Mima\\Codetiq\\git\\git_project\\hello-world\\data\\breaks.csv')
display(raw_breaks)
raw_breaks.dtypes

,break_id,shift_id,break_start,break_finish,is_paid
0,f5ffdd74-df11-46c3-bf1b-2d4a31c67b85,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01 12:00:00,2025-01-01 12:30:00,False
1,b75ac3fe-b09d-4605-9c7c-46c5d29f8d98,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02 12:30:00,2025-01-02 13:00:00,True
2,3a2d8c8b-17a6-47c9-b4c1-bc6f08d0a1e1,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04 13:00:00,2025-01-04 13:30:00,False
3,4f6ab562-bca1-48ae-bf1f-b953d32d03f6,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05 11:30:00,2025-01-05 12:00:00,True
4,b2b70a8d-12f3-4b9b-9b94-3e7a3b30943a,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06 12:00:00,2025-01-06 12:30:00,False

break_id        object
shift_id        object
break_start     object
break_finish    object
is_paid           bool
dtype: object

In [72]:
raw_allowances = pd.read_csv('C:\\Users\\Igor\\Desktop\\Mima\\Codetiq\\git\\git_project\\hello-world\\data\\allowances.csv')
display(raw_allowances)
raw_allowances.dtypes

,allowance_id,shift_id,allowance_value,allowance_cost
0,ea765a5d-3dbb-48f9-b9f4-5b4e3a15e464,a7df23c2-4890-4d62-99c1-e6cc5419b568,5.0,25.0
1,df18d5d0-e2c1-4a32-b9bb-90a67db75e6e,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,3.5,15.0
2,bd52f4b9-b0ba-4784-b3fd-e812fb722227,d81b5d8e-3fba-4b6b-8617-3d458836bd93,7.0,40.0
3,f56cf36e-e5ab-4165-b080-df2aaf9052b2,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,4.0,18.0
4,3ed682b1-e029-4ad7-bf0b-8221e604da44,7e9d9fe1-300d-4e64-9386-39435b3b3d93,6.0,30.0

allowance_id        object
shift_id            object
allowance_value    float64
allowance_cost     float64
dtype: object

In [73]:
raw_award_intr = pd.read_csv('C:\\Users\\Igor\\Desktop\\Mima\\Codetiq\\git\\git_project\\hello-world\\data\\award_interpretations.csv')
display(raw_award_intr)
raw_award_intr.dtypes

,award_id,shift_id,award_date,award_units,award_cost
0,57b6c0f2-df51-4ca7-b3ab-5a9a3f59304d,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2.0,50.0
1,1c1e5279-5ab1-4c30-8fa2-39ac3a220b76,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,3.5,75.0
2,d115bd01-9cc9-42b0-88ca-e7e7c899a3b0,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-03,1.5,45.0
3,ad2cf4b3-080b-4762-88fd-234855e6f0f1,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-04,2.0,40.0
4,c408365e-9939-4c79-b249-96fa39f7f378,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-05,4.0,120.0

award_id        object
shift_id        object
award_date      object
award_units    float64
award_cost     float64
dtype: object

Staging phase - add new field shift.cost into shifts DataFrame (sum of all costs in one shift - allowance and award interpretation costs)

In [74]:
display(raw_shifts.head())
display(raw_allowances.head())
display(raw_award_intr.head())

,shift_id,shift_date,shift_start,shift_finish
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00

,allowance_id,shift_id,allowance_value,allowance_cost
0,ea765a5d-3dbb-48f9-b9f4-5b4e3a15e464,a7df23c2-4890-4d62-99c1-e6cc5419b568,5.0,25.0
1,df18d5d0-e2c1-4a32-b9bb-90a67db75e6e,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,3.5,15.0
2,bd52f4b9-b0ba-4784-b3fd-e812fb722227,d81b5d8e-3fba-4b6b-8617-3d458836bd93,7.0,40.0
3,f56cf36e-e5ab-4165-b080-df2aaf9052b2,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,4.0,18.0
4,3ed682b1-e029-4ad7-bf0b-8221e604da44,7e9d9fe1-300d-4e64-9386-39435b3b3d93,6.0,30.0

,award_id,shift_id,award_date,award_units,award_cost
0,57b6c0f2-df51-4ca7-b3ab-5a9a3f59304d,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2.0,50.0
1,1c1e5279-5ab1-4c30-8fa2-39ac3a220b76,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,3.5,75.0
2,d115bd01-9cc9-42b0-88ca-e7e7c899a3b0,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-03,1.5,45.0
3,ad2cf4b3-080b-4762-88fd-234855e6f0f1,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-04,2.0,40.0
4,c408365e-9939-4c79-b249-96fa39f7f378,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-05,4.0,120.0

In [75]:
# Join shifts, allowances and awards in order to get sum of costs for each shift
joined_shifts = raw_shifts.join(raw_allowances, how = 'left', lsuffix='shift_id', rsuffix='shift_id').join(raw_award_intr, how = 'left', lsuffix='shift_id', rsuffix='shift_id')
joined_shifts['shift_cost'] = joined_shifts['allowance_cost'] + joined_shifts['award_cost']
display(joined_shifts)

,shift_idshift_id,shift_date,shift_start,shift_finish,allowance_id,shift_idshift_id,allowance_value,allowance_cost,award_id,shift_id,award_date,award_units,award_cost,shift_cost
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00,ea765a5d-3dbb-48f9-b9f4-5b4e3a15e464,a7df23c2-4890-4d62-99c1-e6cc5419b568,5.0,25.0,57b6c0f2-df51-4ca7-b3ab-5a9a3f59304d,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2.0,50.0,75.0
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00,df18d5d0-e2c1-4a32-b9bb-90a67db75e6e,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,3.5,15.0,1c1e5279-5ab1-4c30-8fa2-39ac3a220b76,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,3.5,75.0,90.0
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00,bd52f4b9-b0ba-4784-b3fd-e812fb722227,d81b5d8e-3fba-4b6b-8617-3d458836bd93,7.0,40.0,d115bd01-9cc9-42b0-88ca-e7e7c899a3b0,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-03,1.5,45.0,85.0
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00,f56cf36e-e5ab-4165-b080-df2aaf9052b2,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,4.0,18.0,ad2cf4b3-080b-4762-88fd-234855e6f0f1,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-04,2.0,40.0,58.0
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00,3ed682b1-e029-4ad7-bf0b-8221e604da44,7e9d9fe1-300d-4e64-9386-39435b3b3d93,6.0,30.0,c408365e-9939-4c79-b249-96fa39f7f378,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-05,4.0,120.0,150.0

In [76]:
# Create staging shifts -> select and rename according columns
stg_shifts = joined_shifts[["shift_idshift_id", "shift_date","shift_start", "shift_finish","shift_cost"]]
stg_shifts.columns = ['shift_id_1', 'shift_id_2', 'shift_date', 'shift_start', 'shift_finish', 'shift_cost'] # in order to have different shift ids
stg_shifts.rename(columns = {'shift_id_1': 'shift_id_'}, inplace = True)
stg_shifts = stg_shifts.drop('shift_id_2', axis = 1)  #axis = 1 means that we are dropping COLUMN, not ROW
display(stg_shifts)

C:\Users\Igor\AppData\Local\Temp\ipykernel_8352\2107696856.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  stg_shifts.rename(columns = {'shift_id_1': 'shift_id_'}, inplace = True)

,shift_id_,shift_date,shift_start,shift_finish,shift_cost
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00,75.0
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00,90.0
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00,85.0
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00,58.0
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00,150.0

Create staging KPI DataFrame - kpi_id, kpi_name, kpi_date, kpi_value

In [77]:
# First new row = mean_break_length_in_minutes = Mean shift break time in minutes (between break_start and break_finish)
stg_breaks = raw_breaks
stg_breaks['break_start'] = pd.to_datetime(stg_breaks['break_start'])
stg_breaks['break_finish'] = pd.to_datetime(stg_breaks['break_finish'])
stg_breaks['break_duration'] = stg_breaks['break_finish'] - stg_breaks['break_start'] # the result that we get ('o days 00:30:00') is timedelta -> we need to transform it in minutes
stg_breaks['break_duration'] = stg_breaks['break_duration'].dt.total_seconds()/60 # this is how we get it in minutes
#display(stg_breaks.dtypes)
#display(stg_breaks)
mean_break_length = (stg_breaks['break_duration'].sum()) / (len(stg_breaks))
print(mean_break_length)
stg_kpis = pd.DataFrame(columns = ('kpi_name', 'kpi_value', 'kpi_date'))
new_row = pd.DataFrame({'kpi_value': [mean_break_length], 'kpi_name': ['mean_break_length'],'kpi_date': [pd.to_datetime('now')]})
stg_kpis = pd.concat([stg_kpis, new_row], ignore_index = True)
display(stg_kpis)

30.0

C:\Users\Igor\AppData\Local\Temp\ipykernel_8352\46978077.py:13: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.
  stg_kpis = pd.concat([stg_kpis, new_row], ignore_index = True)

            kpi_name  kpi_value                   kpi_date
0  mean_break_length       30.0 2025-01-13 10:36:28.039491

In [78]:
# Second new row - mean shift cost 
display(stg_kpis)
#display(stg_shifts)
mean_shift_cost = (stg_shifts['shift_cost'].sum() / len(stg_shifts))
#print(mean_shift_cost)
new_row = pd.DataFrame({'kpi_name': ['mean_shift_cost'], 'kpi_value': [mean_shift_cost], 'kpi_date': [pd.to_datetime('now')]})
stg_kpis = pd.concat([stg_kpis,new_row])
display(stg_kpis)

            kpi_name  kpi_value                   kpi_date
0  mean_break_length       30.0 2025-01-13 10:36:28.039491

            kpi_name  kpi_value                   kpi_date
0  mean_break_length       30.0 2025-01-13 10:36:28.039491
0    mean_shift_cost       91.6 2025-01-13 10:36:28.057175

In [79]:
# Third new row - max allowance cost in the last 14 days
# First part - get subset of shisfts that were in the last 14 days
stg_shifts["shift_date"] = pd.to_datetime(stg_shifts["shift_date"])
stg_shifts["delta_in_days"] = (pd.to_datetime("now") - stg_shifts["shift_date"]).dt.days
sub_shifts = stg_shifts[stg_shifts["delta_in_days"] <= 14]
display(sub_shifts)
display(raw_allowances)

,shift_id_,shift_date,shift_start,shift_finish,shift_cost,delta_in_days
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00,75.0,12
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00,90.0,11
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00,85.0,9
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00,58.0,8
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00,150.0,7

,allowance_id,shift_id,allowance_value,allowance_cost
0,ea765a5d-3dbb-48f9-b9f4-5b4e3a15e464,a7df23c2-4890-4d62-99c1-e6cc5419b568,5.0,25.0
1,df18d5d0-e2c1-4a32-b9bb-90a67db75e6e,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,3.5,15.0
2,bd52f4b9-b0ba-4784-b3fd-e812fb722227,d81b5d8e-3fba-4b6b-8617-3d458836bd93,7.0,40.0
3,f56cf36e-e5ab-4165-b080-df2aaf9052b2,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,4.0,18.0
4,3ed682b1-e029-4ad7-bf0b-8221e604da44,7e9d9fe1-300d-4e64-9386-39435b3b3d93,6.0,30.0

In [80]:
# Second part (switch join positions in order to see what will happen in pull request) 
# Again we are joining allowances and sub_shifts but with different order 
joined_allowances_sub_shifts_2 = raw_allowances.join(sub_shifts, lsuffix= "shift_id", rsuffix="shift_id_", how = "left")
max_allowance = joined_allowances_sub_shifts_2["allowance_cost"].max()
print("Max allowance cost in the previous 14 days is: ", max_allowance)
# Third part - add this new value to stg_kpis
new_row = pd.DataFrame({'kpi_name': ["max_allowance_cost_14d"], 'kpi_value': [max_allowance]})
stg_kpis = pd.concat([stg_kpis, new_row])
display(stg_kpis)

Max allowance cost in the previous 14 days is:  40.0

                 kpi_name  kpi_value                   kpi_date
0       mean_break_length       30.0 2025-01-13 10:36:28.039491
0         mean_shift_cost       91.6 2025-01-13 10:36:28.057175
0  max_allowance_cost_14d       40.0                        NaT

In [81]:
# Fourth new row - min shift length in hours
# Add new column that represents shift duration (difference in hours between shift_end and shift_start)
stg_shifts["shift_finish"] = pd.to_datetime(stg_shifts["shift_finish"])
stg_shifts["shift_start"] = pd.to_datetime(stg_shifts["shift_start"])
stg_shifts["shift_duration"] = ((stg_shifts["shift_finish"] - stg_shifts["shift_start"]).dt.total_seconds()) / 3600
display(stg_shifts)

,shift_id_,shift_date,shift_start,shift_finish,shift_cost,delta_in_days,shift_duration
0,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01,2025-01-01 08:00:00,2025-01-01 16:00:00,75.0,12,8.0
1,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02,2025-01-02 08:00:00,2025-01-02 16:00:00,90.0,11,8.0
2,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04,2025-01-04 09:00:00,2025-01-04 17:00:00,85.0,9,8.0
3,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05,2025-01-05 07:00:00,2025-01-05 15:00:00,58.0,8,8.0
4,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06,2025-01-06 08:00:00,2025-01-06 16:00:00,150.0,7,8.0

In [82]:
# Get minimum shift duration and add it as new row in stg_kpis
min_shift_duration = stg_shifts["shift_duration"].min()
new_row = pd.DataFrame({'kpi_name': ['min_shift_duration'], 'kpi_value': [min_shift_duration], 'kpi_date': [[pd.to_datetime('now')]]})
stg_kpis = pd.concat([stg_kpis, new_row])
display(stg_kpis)

                 kpi_name  kpi_value                      kpi_date
0       mean_break_length       30.0    2025-01-13 10:36:28.039491
0         mean_shift_cost       91.6    2025-01-13 10:36:28.057175
0  max_allowance_cost_14d       40.0                           NaT
0      min_shift_duration        8.0  [2025-01-13 10:36:28.118892]

In [83]:
# Add fifth row to stg_kpis - total number of paid breaks
display(stg_breaks)
# Get subset of breaks which are paid 
sub_breaks = stg_breaks[stg_breaks["is_paid"]]
display(sub_breaks)
number_of_paid_breaks = len(sub_breaks)
new_row = pd.DataFrame({'kpi_name': ['total_number_of_paid_breaks'], 'kpi_value': [number_of_paid_breaks]})
stg_kpis = pd.concat([stg_kpis, new_row])
display(stg_kpis)

,break_id,shift_id,break_start,break_finish,is_paid,break_duration
0,f5ffdd74-df11-46c3-bf1b-2d4a31c67b85,a7df23c2-4890-4d62-99c1-e6cc5419b568,2025-01-01 12:00:00,2025-01-01 12:30:00,False,30.0
1,b75ac3fe-b09d-4605-9c7c-46c5d29f8d98,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02 12:30:00,2025-01-02 13:00:00,True,30.0
2,3a2d8c8b-17a6-47c9-b4c1-bc6f08d0a1e1,d81b5d8e-3fba-4b6b-8617-3d458836bd93,2025-01-04 13:00:00,2025-01-04 13:30:00,False,30.0
3,4f6ab562-bca1-48ae-bf1f-b953d32d03f6,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05 11:30:00,2025-01-05 12:00:00,True,30.0
4,b2b70a8d-12f3-4b9b-9b94-3e7a3b30943a,7e9d9fe1-300d-4e64-9386-39435b3b3d93,2025-01-06 12:00:00,2025-01-06 12:30:00,False,30.0

,break_id,shift_id,break_start,break_finish,is_paid,break_duration
1,b75ac3fe-b09d-4605-9c7c-46c5d29f8d98,c2fa27b9-b49e-49f5-8c51-1acb869ff27f,2025-01-02 12:30:00,2025-01-02 13:00:00,True,30.0
3,4f6ab562-bca1-48ae-bf1f-b953d32d03f6,8ed7f7f2-6bc5-42fc-98b9-3d9eaf7cdcf1,2025-01-05 11:30:00,2025-01-05 12:00:00,True,30.0

                      kpi_name  kpi_value                      kpi_date
0            mean_break_length       30.0    2025-01-13 10:36:28.039491
0              mean_shift_cost       91.6    2025-01-13 10:36:28.057175
0       max_allowance_cost_14d       40.0                           NaT
0           min_shift_duration        8.0  [2025-01-13 10:36:28.118892]
0  total_number_of_paid_breaks        2.0                           NaN

In [136]:
# Add sixth row - longest period in days when consecutive shifts did not have breaks
# Firstly add additional column that represents date of the following shift 
sub_shifts_cons = stg_shifts.loc[:,[ 'shift_date']]
sub_shifts_cons['next_shift'] = sub_shifts_cons['shift_date'].shift(-1)
sub_shifts_cons['previous_shift'] = sub_shifts_cons['shift_date'].shift(1)
sub_shifts_cons = sub_shifts_cons[ ((sub_shifts_cons['next_shift'] - sub_shifts_cons['shift_date']).dt.days != 1) | ((sub_shifts_cons['shift_date'] - sub_shifts_cons['previous_shift']).dt.days != 1)]
display(sub_shifts_cons)
print(sub_shifts_cons.columns)
sub_shifts_cons['next_shift'] = sub_shifts_cons['shift_date'].shift(-1)
sub_shifts_cons['final_days'] = sub_shifts_cons.apply(
           lambda row: (row['next_shift'] - row['shift_date']).days + 1 if 
           ( pd.isna(row['previous_shift']) or (row['shift_date'] - row['previous_shift']).days >  1) 
           else None,
           axis = 1)
# Axis = 0 -> this makes the function apply row-wise, meaning that it will be applied to each row of the DataFrame
max_cons = sub_shifts_cons['final_days'].max()
print("Longest period when consecutive shifts did not have breaks: ", max_cons )
new_row = pd.DataFrame({'kpi_name': ['max_break_free_shift_period_in_days'], 'kpi_value': [max_cons]})
stg_kpis = pd.concat([stg_kpis, new_row])
display(stg_kpis)

  shift_date next_shift previous_shift
0 2025-01-01 2025-01-02            NaT
1 2025-01-02 2025-01-04     2025-01-01
2 2025-01-04 2025-01-05     2025-01-02
4 2025-01-06        NaT     2025-01-05

Index(['shift_date', 'next_shift', 'previous_shift'], dtype='object')
Longest period when consecutive shifts did not have breaks:  3.0

,kpi_name,kpi_value,kpi_date
0,mean_break_length,30.0,2025-01-13 10:36:28.039491
0,mean_shift_cost,91.6,2025-01-13 10:36:28.057175
0,max_allowance_cost_14d,40.0,NaT
0,min_shift_duration,8.0,[2025-01-13 10:36:28.118892]
0,total_number_of_paid_breaks,2.0,NaN
0,max_break_free_shift_period_in_days,3.0,NaN